---
kind: method
id: M:Autodesk.Revit.DB.PolymeshFacet.ToString
source: html/390467c4-89ae-e7f3-9b3f-ead75b7a272f.htm
---
# Autodesk.Revit.DB.PolymeshFacet.ToString Method

Returns formatted string showing (V1, V2, V3) with values formatted as regular integers

## Syntax (C#)
```csharp
public override string ToString()
```